src/Documents/Scan_ПрайсЛистАренда/Scan_ПрайсЛистАренда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ПрайсЛистАренда</name>
  <registerRecords>InformationRegister.Scan_ЦеныНаАренду</registerRecords>
  <attributes>
    <name>ДатаВступленияВСилу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПФУсловияАренды</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШкалаПробегаАренды</name>
    <attributes>
      <name>ПробегОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШкалаСрокаАренды</name>
    <attributes>
      <name>СрокОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеныНаАренду</name>
    <attributes>
      <name>СрокОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Scan_ПрайсЛистАрендаПрисоединенныеФайлы/Scan_ПрайсЛистАрендаПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ПрайсЛистАрендаПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.Scan_ПрайсЛистАренда</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Scan_ПрайсЛистАренда/Forms/ФормаНастроекПечати/Module.bsl
#Область ОбработчикиСобытийФормы
// rarus vikhle 08.12.2021 m 18340 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрайсЛист = Параметры.ДанныеДляПечати;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ПрайсЛистАрендаПрисоединенныеФайлы.Ссылка КАК Файл,
	               |	Scan_ПрайсЛистАрендаПрисоединенныеФайлы.Расширение КАК Расширение
	               |ИЗ
	               |	Справочник.Scan_ПрайсЛистАрендаПрисоединенныеФайлы КАК Scan_ПрайсЛистАрендаПрисоединенныеФайлы
	               |ГДЕ
	               |	Scan_ПрайсЛистАрендаПрисоединенныеФайлы.ВладелецФайла = &ПрайсЛист
	               |	И Scan_ПрайсЛистАрендаПрисоединенныеФайлы.Расширение В(&РасширенияКартинок)
	               |	И НЕ Scan_ПрайсЛистАрендаПрисоединенныеФайлы.ПометкаУдаления";
	РасширенияКартинок = Новый Массив;
	РасширенияКартинок.Добавить("bmp");
	РасширенияКартинок.Добавить("jpeg");
	РасширенияКартинок.Добавить("jpg");
	РасширенияКартинок.Добавить("png");
	
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	Запрос.УстановитьПараметр("РасширенияКартинок", РасширенияКартинок);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Файлы.Добавить(), Выборка);	
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтображатьПревьюПриИзменении(Элемент)
	
	Если ОтображатьПревью Тогда 
		ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			АдресКартинки = ПолучитьКартинку(ТекущиеДанные.Файл, УникальныйИдентификатор);	
		КонецЕсли;	
	Иначе	
		АдресКартинки = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	Если ОтображатьПревью Тогда
		ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			АдресКартинки = ПолучитьКартинку(ТекущиеДанные.Файл, УникальныйИдентификатор); 
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	МассивФайлов = МассивФайлов();
	ПараметрыПечати = Новый Структура("МассивФайлов", МассивФайлов());
	
	Если Файлы.Количество() <> 0 И МассивФайлов.Количество() = 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаПечати", ЭтотОбъект, ПараметрыПечати);
		ПоказатьВопрос(ОписаниеОповещения, Нстр("ru = 'Не выбрано ни 1 изображение, продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	ИначеЕсли МассивФайлов.Количество() > 4 Тогда 	
		ВывестиСообщениеПол(Нстр("ru = 'В печатной форме может отображаться максимум 4 изображения'"));
		Возврат;	
	Иначе
		ПечатьПродолжение(ПараметрыПечати);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для Каждого СтрокаТЗ Из Файлы Цикл
		СтрокаТЗ.Флаг = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для Каждого СтрокаТЗ Из Файлы Цикл
		СтрокаТЗ.Флаг = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МассивФайлов()
	
	ФайлыТЗ = РеквизитФормыВЗначение("Файлы");
	Отбор = Новый Структура("Флаг", Истина);
	ВыбранныеСтроки = Файлы.НайтиСтроки(Отбор);
	МассивФайлов = ОбщегоНазначения.ВыгрузитьКолонку(ВыбранныеСтроки, "Файл");
	
	Возврат МассивФайлов;
		
КонецФункции

&НаКлиенте
Процедура ПослеВопросаПечати(Результат, ПараметрыПечати) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПечатьПродолжение(ПараметрыПечати);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПечатьПродолжение(ПараметрыПечати)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Scan_ПрайсЛистАренда",       
													"ПФ_MXL_ПрайсЛистАренда",           
													ПрайсЛист,       
													ЭтотОбъект,
													ПараметрыПечати);
	Закрыть();
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьКартинку(Файл, УникальныйИдентификатор) //rarus vikhle 24.12.2021 апк убрал экспорт 
	
	Возврат РаботаСФайламиСлужебный.НавигационнойСсылкиФайла(Файл, УникальныйИдентификатор);
	
КонецФункции	

// rarus vikhle 08.12.2021 m 18340 ---
#КонецОбласти
